package operatori;

public class Ternarniy_operatori {
    public static void main(String[] args) {

        int a, b;
        a = 10;
        b = (a == 1) ? 20 : 30;
        System.out.println("Значение b: " + b);

        b = (a == 10) ? 20 : 30;
        System.out.println("Значение и: "+b);


    }
}
    /*
    Тернарный оператор — оператор, который состоит из трех операндов и
    используется для оценки выражений типа boolean. Тернарный оператор в
    Java также известен как условный оператор. Этот. Цель тернарного
    оператора или условного оператора заключается в том, чтобы решить,
     какое значение должно быть присвоено переменной. Оператор записывается в виде:
     */